# CONCAT

In [1]:
import pandas as pd

In [4]:
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","bangalore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [3]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [5]:
df = pd.concat([india_weather,us_weather])
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
0   new york           21        68
1    chicago           14        65
2    orlando           35        75

In [7]:
df = pd.concat([india_weather,us_weather],ignore_index=True)
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
3   new york           21        68
4    chicago           14        65
5    orlando           35        75

In [8]:
df = pd.concat([india_weather,us_weather],keys=["INDIA","US"])
df

              city  temperature  humidity
INDIA 0     mumbai           32        80
      1      delhi           45        60
      2  bangalore           30        78
US    0   new york           21        68
      1    chicago           14        65
      2    orlando           35        75

In [9]:
df.loc["INDIA"]

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [10]:
df.loc["US"]

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [14]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","bangalore"],
    "temperature": [32,45,30],
})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [13]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai","bangalore"],
    "windspeed": [7,12,10],
})
windspeed_df

        city  windspeed
0      delhi          7
1     mumbai         12
2  bangalore         10

In [20]:
df = pd.concat([temperature_df,windspeed_df],axis=0)
df

        city  temperature  windspeed
0     mumbai         32.0        NaN
1      delhi         45.0        NaN
2  bangalore         30.0        NaN
0      delhi          NaN        7.0
1     mumbai          NaN       12.0
2  bangalore          NaN       10.0

In [16]:
df = pd.merge(temperature_df,windspeed_df,on="city")

In [17]:
df

        city  temperature  windspeed
0     mumbai           32         12
1      delhi           45          7
2  bangalore           30         10

In [19]:
df = pd.concat([temperature_df,windspeed_df],axis=1)
df

        city  temperature       city  windspeed
0     mumbai           32      delhi          7
1      delhi           45     mumbai         12
2  bangalore           30  bangalore         10

In [21]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [22]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
}, index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [23]:
df = pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN

In [24]:
s = pd.Series(["Humid","Dry","Rain"], name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [25]:
df = pd.concat([temperature_df,s],axis=1)
df

       city  temperature  event
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           30   Rain

In [28]:
s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])

In [27]:
s1

0    a
1    b
dtype: object

In [29]:
s2

0    c
1    d
dtype: object

In [30]:
pd.concat([s1, s2])

0    a
1    b
0    c
1    d
dtype: object

In [31]:
pd.concat([s1, s2], ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object

In [32]:
pd.concat([s1, s2], keys=['s1', 's2'])

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [34]:
pd.concat([s1, s2], keys=['s1', 's2'],
          names=['Series name', 'Row ID'])

Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object